{
    "Can I get a child plan, and what documents do I need to claim?_categories": [
        "policy_types",
        "claims"
    ],
    "Can I get a child plan, and what documents do I need to claim?": "You can get a child plan, which is designed to build savings for a child's future needs, such as education, while often providing life cover for the parent or policyholder. To claim under this plan, you will typically need to provide documents such as the policy document, death certificate (if applicable), and proof of the child's age and identity. Additionally, you may need to submit a claim form, medical reports, or accident reports, depending on the circumstances of the claim.\n\nTo initiate the claim process, it's essential to review your policy documents to understand the specific requirements for claiming under your child plan. You will need to submit the required documents, which may include the original policy, death certificate, and ID proof of the beneficiary. The claims process typically takes 15 to 30 days, but complex claims may take longer. To avoid delays or rejections, ensure you have all necessary documents ready before submitting your claim.",
    "Can I add a child plan to my policy?_categories": [
        "policy_types",
        "eligibility"
    ],
    "What are the benefits of a term life policy, and how do I claim it?_categories": [
        "policy_types",
        "benefits",
        "claims"
    ],
    "What are the benefits of a term life policy, and how do I claim it?": "A term life insurance policy provides coverage for a fixed period and offers several benefits, including lower premiums and no cash value accumulation. If the insured dies within the term, the policy pays a lump-sum death benefit to the beneficiary. To claim a term life policy, the beneficiary should contact the insurance company and provide a death certificate, after which the company will guide them through the claims process. The payout is typically made in a lump sum, although some policies may offer alternative settlement options, such as annuity-style payments. It's crucial to review the policy documents, understand the terms and conditions, and ensure the policy is active with up-to-date premiums to avoid any issues during the claims process."
}